# ----------------------------------------------------
# 如果不使用国内源，可以使用
# source "https://rubygems.org"
# ----------------------------------------------------
source "https://ruby.taobao.org"

# ----------------------------------------------------
# 常规采用的 grape 稳定版本
# ----------------------------------------------------
gem "grape", "0.14.0"
gem "grape-entity", "0.5.0"

# ----------------------------------------------------
# 在开发环境下，可以支持 CORS
# 但在产品模式下不建议
# ----------------------------------------------------
group :development do
  gem "rack-cors"
end

# ----------------------------------------------------
# 运行服务，在开发模式下可采用 shotgun
# ----------------------------------------------------
gem "puma", "2.15.3"
group :development do
  gem "shotgun"
end

gem "jwt"
gem "net-ldap", "0.12.1"
gem "adauth"
